# DS 2002 Midterm Project - Alysha Akhtar (yhc8vx)

This project was created using the sakila database. Initially, the sakila-schema.sql and the sakila-data.sql files were run to create the original sakila database in MySQL.

## Initial Set-Up

#### Import necessary libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Connect to MongoDB and MySQL

In [9]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_hostname = "localhost"

atlas_cluster_name = "cluster0.ks1ubfx"
atlas_user_name = "yhc8vx"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

m_src_dbname = "stakila"
s_src_dbname = "sakila"
dst_dbname = "sakila_dm"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://yhc8vx:Passw0rd123@cluster0.ks1ubfx.mongodb.net

#### Define functions for getting data from and setting data into databases

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Populate MongoDB with Source Data

In [4]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[m_src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'midtermdata')

json_files = {"customer" : 'sakila_customer.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")

        
client.close()

Collection(Database(MongoClient(host=['ac-usqn5vy-shard-00-01.ks1ubfx.mongodb.net:27017', 'ac-usqn5vy-shard-00-02.ks1ubfx.mongodb.net:27017', 'ac-usqn5vy-shard-00-00.ks1ubfx.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-yxwzfb-shard-0', tls=True), 'stakila'), 'customer') was successfully loaded.

#### Create new data mart

In [5]:
conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_hostname}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

## Extract Data from MySQL, MongoDB, and Local File to Create Dataframes

#### Extract MySQL Data from Source Database Tables

In [6]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_payment)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [7]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_inventory)
df_inventory.head(2)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17

In [8]:
sql_rental = "SELECT * FROM sakila.rental;"
df_rental = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_rental)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

#### Extract Data from MongoDB
Run "Connect to MongoDB and MySQL" again before this

In [10]:
query = {} # Select all elements (columns), and all documents (rows).
collection = "customer"

df_customer = get_mongo_dataframe(conn_str['atlas'], m_src_dbname, collection, query)  # Specify 'atlas', or 'local'
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

#### Extract data from local machine

In [11]:
df_film = pd.read_csv(r'C:\Users\ds2002-student\Documents\DS-2002-main\DS-2002-main\Projects\midtermdata\sakila_film.csv')
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

## Create and Perform Transformations on Dimension Tables (df_customer and df_film)

#### Perform Necessary Transformations

In [12]:
# Dropping unnecessary columns from df_customer
drop_cols = ['store_id','address_id','last_update', 'create_date']
df_customer.drop(drop_cols, axis=1, inplace=True)

# Renaming customer_id to be customer_key
df_customer.rename(columns={"customer_id":"customer_key"}, inplace=True)

df_customer.head(2)

,customer_key,first_name,last_name,email,active
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1

In [13]:
# Dropping unnecessary columns from df_film
drop_cols = ['language_id','original_language_id','last_update', 'special_features', 'description']
df_film.drop(drop_cols, axis=1, inplace=True)

# Renaming film_id to be film_key
df_film.rename(columns={"film_id":"film_key"}, inplace=True)

df_film.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating
0,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG
1,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G

#### Load the Transformed DataFrames into the New Data Warehouse by Creating New Dimension Tables

In [14]:
db_operation = "insert"

tables = [('dim_customer', df_customer, 'customer_key'),
          ('dim_film', df_film, 'film_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

## Create & Populate the Fact Table Using df_payment, df_rental, and df_inventory

#### Perform necessary transformations

In [15]:
# Dropping unnecessary columns from df_rental. 
# Staff information is not being included in this data mart and last update is irrelevant for this analysis.
df_rental.drop(['staff_id', 'last_update'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33

In [16]:
# Dropping unnecessary columns from df_inventory. 
# Store information is not being included in this data mart, and last update is irrelevant for this analysis.
df_inventory.drop(['store_id', 'last_update'], axis=1, inplace=True)
df_inventory.head(2)

   inventory_id  film_id
0             1        1
1             2        1

In [17]:
# Dropping unnecessary columns from df_payment.
# Staff information is not being included in this data mart. Last update is irrelevant for this analysis.
# Customer ID is already included in df_rental so it is redundant. payment_date contains the same information as rental_date.
df_payment.drop(['staff_id', 'last_update', 'customer_id', 'payment_date'], axis=1, inplace=True)
df_payment.head(2)

   payment_id  rental_id  amount
0           1         76    2.99
1           2        573    0.99

#### Merge rental and inventory tables

In [18]:
df_rentalinventory = pd.merge(df_rental, df_inventory, on = 'inventory_id', how = 'inner')
df_rentalinventory.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,film_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,80
1,1577,2005-06-16 04:03:28,367,327,2005-06-24 22:40:28,80
2,3584,2005-07-06 04:16:43,367,207,2005-07-13 07:08:43,80
3,10507,2005-08-01 11:22:20,367,45,2005-08-04 13:18:20,80
4,13641,2005-08-20 07:34:42,367,281,2005-08-26 05:18:42,80

#### Merge merged table with payment table to create fact table

In [19]:
df_fact_rentals = pd.merge(df_rentalinventory, df_payment, on = 'rental_id', how = 'inner')
df_fact_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,film_id,payment_id,amount
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,80,3504,2.99
1,1577,2005-06-16 04:03:28,367,327,2005-06-24 22:40:28,80,8828,3.99
2,3584,2005-07-06 04:16:43,367,207,2005-07-13 07:08:43,80,5603,2.99
3,10507,2005-08-01 11:22:20,367,45,2005-08-04 13:18:20,80,1244,2.99
4,13641,2005-08-20 07:34:42,367,281,2005-08-26 05:18:42,80,7623,2.99

#### Get data from the date dimension table
Run Lab 2c code on sakila_dm before this code

In [21]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dm.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

#### Split up datetime variables return_time and rental_time into date and time

In [22]:
df_fact_rentals['return_time'] = df_fact_rentals['return_date'].dt.time
df_fact_rentals['return_date'] = df_fact_rentals['return_date'].dt.date

df_fact_rentals['rental_time'] = df_fact_rentals['rental_date'].dt.time
df_fact_rentals['rental_date'] = df_fact_rentals['rental_date'].dt.date

df_fact_rentals.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,film_id,payment_id,amount,return_time,rental_time
0,1,2005-05-24,367,130,2005-05-26,80,3504,2.99,22:04:30,22:53:30
1,1577,2005-06-16,367,327,2005-06-24,80,8828,3.99,22:40:28,04:03:28

#### Convert new objects rental_date and return_date to datetime type

In [23]:
df_fact_rentals['rental_date'] = pd.to_datetime(df_fact_rentals['rental_date'], format='%Y-%m-%d')
df_fact_rentals['return_date'] = pd.to_datetime(df_fact_rentals['return_date'], format='%Y-%m-%d')

#### Lookup the DateKeys from the Date Dimension Table.

In [24]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "rental_date" Column.
df_dim_rental_date = df_dim_date.rename(columns = {"date_key" : "rental_date_key", "full_date" : "rental_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_rental_date, on = 'rental_date', how = 'left')
df_fact_rentals.drop(['rental_date'], axis = 1, inplace = True)
df_fact_rentals.head(2)

,rental_id,inventory_id,customer_id,return_date,film_id,payment_id,amount,return_time,rental_time,rental_date_key
0,1,367,130,2005-05-26,80,3504,2.99,22:04:30,22:53:30,20050524
1,1577,367,327,2005-06-24,80,8828,3.99,22:40:28,04:03:28,20050616

In [25]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "return_date" Column.
df_dim_return_date = df_dim_date.rename(columns = {"date_key" : "return_date_key", "full_date" : "return_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_return_date, on = 'return_date', how = 'left')
df_fact_rentals.drop(['return_date'], axis = 1, inplace = True)
df_fact_rentals.head(2)

,rental_id,inventory_id,customer_id,film_id,payment_id,amount,return_time,rental_time,rental_date_key,return_date_key
0,1,367,130,80,3504,2.99,22:04:30,22:53:30,20050524,20050526.0
1,1577,367,327,80,8828,3.99,22:40:28,04:03:28,20050616,20050624.0

#### Perform Additional Transformations

In [26]:
# Drop unwanted columns
drop_columns = ['return_time', 'rental_time', 'inventory_id', 'payment_id']
df_fact_rentals.drop(drop_columns, axis = 1, inplace = True)

# Rename foreign key columns
df_fact_rentals.rename(columns = {"rental_id":"rental_key", "customer_id":"customer_key", "film_id":"film_key"}, inplace=True)

# Reorder columns
ordered_columns = ['rental_key', 'customer_key', 'film_key', 'rental_date_key', 'return_date_key', 'amount']
df_fact_rentals = df_fact_rentals[ordered_columns]

# Insert new column to serve as primary key
df_fact_rentals.insert(0, "fact_rental_key", range(1, df_fact_rentals.shape[0]+1))

In [27]:
df_fact_rentals.head(10)

,fact_rental_key,rental_key,customer_key,film_key,rental_date_key,return_date_key,amount
0,1,1,130,80,20050524,20050526.0,2.99
1,2,1577,327,80,20050616,20050624.0,3.99
2,3,3584,207,80,20050706,20050713.0,2.99
3,4,10507,45,80,20050801,20050804.0,2.99
4,5,13641,281,80,20050820,20050826.0,2.99
5,6,2,459,333,20050524,20050528.0,2.99
6,7,1449,471,333,20050615,20050618.0,2.99
7,8,5499,127,333,20050710,20050717.0,2.99
8,9,9711,231,333,20050731,20050802.0,2.99
9,10,13031,567,333,20050819,20050823.0,2.99

#### Write the DataFrame Back to the Sakila_dm Data Mart

In [28]:
table_name = "fact_rentals"
primary_key = "fact_rental_key"
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, df_fact_rentals, table_name, primary_key, db_operation)

## Demonstrate Functionality of New Fact Table and Dimension Tables

#### Validate that the New Fact Tables and Dimension Tables were Created Using a Select Statement

In [29]:
# Verifying creation of fact rentals table
sql_rental_transactions = "SELECT * FROM sakila_dm.fact_rentals;"
df_fact_rental_transactions = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_rental_transactions)
df_fact_rental_transactions.head(5)

,fact_rental_key,rental_key,customer_key,film_key,rental_date_key,return_date_key,amount
0,1,1,130,80,20050524,20050526.0,2.99
1,2,1577,327,80,20050616,20050624.0,3.99
2,3,3584,207,80,20050706,20050713.0,2.99
3,4,10507,45,80,20050801,20050804.0,2.99
4,5,13641,281,80,20050820,20050826.0,2.99

In [30]:
# Verifying creation of customer dimension table
sql_dim_customers = "SELECT * FROM sakila_dm.dim_customer;"
df_dim_customers = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_customers)
df_dim_customers.head(5)

,customer_key,first_name,last_name,email,active
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1
2,3,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,1
3,4,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,1
4,5,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,1

In [31]:
# Verifying creation of film dimension table
sql_dim_films = "SELECT * FROM sakila_dm.dim_film;"
df_dim_films = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_films)
df_dim_films.head(5)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating
0,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG
1,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G
2,3,ADAPTATION HOLES,2006,7,2.99,50,18.99,NC-17
3,4,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G
4,5,AFRICAN EGG,2006,6,2.99,130,22.99,G

#### Calculate the number of times each film has been rented

In [32]:
sql_test1 = """

SELECT f.title AS film_title
    , COUNT(*) AS rental_count
FROM (sakila_dm.dim_film f
INNER JOIN sakila_dm.fact_rentals r ON f.film_key = r.film_key)
GROUP BY film_title
ORDER BY rental_count DESC;

"""

df_test1 = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_test1)

# This shows the titles of the 10 most rented films and the number of times they have been rented.
df_test1.head(10)

            film_title  rental_count
0   BUCKET BROTHERHOOD            34
1     ROCKETEER MOTHER            33
2       GRIT CLOCKWORK            32
3  RIDGEMONT SUBMARINE            32
4       JUGGLER HARDLY            32
5        SCALAWAG DUCK            32
6       FORWARD TEMPLE            32
7        APACHE DIVINE            31
8         ROBBERS JOON            31
9         NETWORK PEAK            31

#### Calculate the total amount spent by each customer

In [33]:
sql_test2 = """

SELECT c.email AS customer_email
    , SUM(r.amount) AS amount_spent
FROM (sakila_dm.dim_customer c
INNER JOIN sakila_dm.fact_rentals r ON c.customer_key = r.customer_key)
GROUP BY customer_email
ORDER BY amount_spent DESC;

"""

df_test2 = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_test2)

# This shows the emails of the 10 customers who have spent the most and the total amount they have spent.
df_test2.head(10)

                      customer_email  amount_spent
0       KARL.SEAL@sakilacustomer.org        221.55
1    ELEANOR.HUNT@sakilacustomer.org        216.54
2      CLARA.SHAW@sakilacustomer.org        195.58
3   MARION.SNYDER@sakilacustomer.org        194.61
4  RHONDA.KENNEDY@sakilacustomer.org        194.61
5   TOMMY.COLLAZO@sakilacustomer.org        186.62
6     WESLEY.BULL@sakilacustomer.org        177.60
7        TIM.CARY@sakilacustomer.org        175.61
8     MARCIA.DEAN@sakilacustomer.org        175.58
9     ANA.BRADLEY@sakilacustomer.org        174.66

#### Calculate the count of how many films each customer has rented of each rating

In [35]:
sql_test3 = """

SELECT c.email AS customer_email
    , f.rating AS film_rating
    , COUNT(*) AS rental_count
FROM (sakila_dm.dim_customer c
INNER JOIN sakila_dm.fact_rentals r ON c.customer_key = r.customer_key
INNER JOIN sakila_dm.dim_film f ON r.film_key = f.film_key)
GROUP BY customer_email, rating
ORDER BY customer_email ASC;

"""

df_test3 = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, s_src_dbname, sql_test3)

# This shows the emails of customers sorted alphabetically with the number of films they have rented with each rating
df_test3.head(10)

                   customer_email film_rating  rental_count
0  AARON.SELBY@sakilacustomer.org           G             4
1  AARON.SELBY@sakilacustomer.org       NC-17             4
2  AARON.SELBY@sakilacustomer.org          PG             2
3  AARON.SELBY@sakilacustomer.org       PG-13            12
4  AARON.SELBY@sakilacustomer.org           R             2
5   ADAM.GOOCH@sakilacustomer.org           G             2
6   ADAM.GOOCH@sakilacustomer.org       NC-17             6
7   ADAM.GOOCH@sakilacustomer.org          PG             4
8   ADAM.GOOCH@sakilacustomer.org       PG-13             4
9   ADAM.GOOCH@sakilacustomer.org           R             6